# Data Statistic

In [50]:
import pandas as pd
import os
import numpy as np
import numpy

## Data dictionary

In [149]:
df_dic = pd.read_csv(os.path.join('Data','Other','Dictionary.csv'))
df_dic['TA_ID'] = df_dic['TA_ID'].astype(str)
df_dic.head()

,TA_ID,TAMBON_T,TAMBON_E,AM_ID,AMPHOE_T,AMPHOE_E,CH_ID,CHANGWAT_T,CHANGWAT_E,LAT,LONG,Population
0,100101,พระบรมมหาราชวัง,Phra Borom Maha Ratchawang,1001,พระนคร,Phra Nakhon,10,กรุงเทพมหานคร,Bangkok,13.751,100.492,4089
1,100102,วังบูรพาภิรมย์,Wang Burapha Phirom,1001,พระนคร,Phra Nakhon,10,กรุงเทพมหานคร,Bangkok,13.744,100.499,11586
2,100103,วัดราชบพิธ,Wat Ratchabophit,1001,พระนคร,Phra Nakhon,10,กรุงเทพมหานคร,Bangkok,13.750,100.499,3402
3,100104,สำราญราษฎร์,Samran Rat,1001,พระนคร,Phra Nakhon,10,กรุงเทพมหานคร,Bangkok,13.751,100.503,3431
4,100105,ศาลเจ้าพ่อเสือ,San Chaopho Suea,1001,พระนคร,Phra Nakhon,10,กรุงเทพมหานคร,Bangkok,13.754,100.497,3280

In [108]:
df_dic_bangkok_subdist = df_dic.loc[df_dic['TA_ID'].str[:2] == '10']
bangkok_subdist = df_dic_bangkok_subdist['TA_ID'].values
df_dic_nakhon_subdist = df_dic.loc[df_dic['TA_ID'].str[:2] == '80']
nakhon_subdist = df_dic_nakhon_subdist['TA_ID'].values
df_dic_krabi_subdist = df_dic.loc[df_dic['TA_ID'].str[:2] == '81']
krabi_subdist = df_dic_krabi_subdist['TA_ID'].values

## Yearly Dengue Case Statistic

In [5]:
df_case = pd.read_csv(os.path.join('data','Dengue-Cases','DHF','DHF-monthly.csv'))
df_case = df_case.drop("Unnamed: 0", axis=1)
df_case.columns = ['addrcode','Year','Month','NumberCases']
df_case['addrcode'] = df_case['addrcode'].astype(str)
df_case.head(10)

  addrcode  Year  Month  NumberCases
0   103604  2014     10            9
1   101203  2014     10            6
2   101504  2014     10            1
3   100502  2014     10            9
4   103001  2014     10           17
5   102601  2014     10           29
6   103501  2014     10            4
7   104401  2014     10            8
8   104004  2014     10           11
9   101401  2014     10           14

In [6]:
aggregation_function = {'NumberCases': 'sum'}
df_numcase = df_case.groupby([df_case['Year'],df_case['Month'],df_case['addrcode'].str[:2]]).aggregate(aggregation_function).reset_index()
df_numcase.head()

   Year  Month addrcode  NumberCases
0  2014      1       10          405
1  2014      1       80          118
2  2014      1       81           31
3  2014      2       10          313
4  2014      2       80           74

In [7]:
aggregation_function = {'NumberCases': 'sum'}
df_subdist = df_case.groupby([df_case['Year'],df_case['Month'],df_case['addrcode'].str[:2]]).size().reset_index(name='NumSubdist')
df_subdist.head()

   Year  Month addrcode  NumSubdist
0  2014      1       10         111
1  2014      1       80          68
2  2014      1       81          16
3  2014      2       10         110
4  2014      2       80          52

In [8]:
df_countdist =df_case.groupby([df_case['Year'],df_case['Month'],df_case['addrcode'].str[:4]]).size().reset_index(name='NumSubdist')
df_dist = df_countdist.groupby([df_countdist['Year'],df_countdist['Month'],df_countdist['addrcode'].str[:2]]).size().reset_index(name='NumDist')
df_dist.head()

   Year  Month addrcode  NumDist
0  2014      1       10       49
1  2014      1       80       22
2  2014      1       81        7
3  2014      2       10       49
4  2014      2       80       20

In [9]:
df_num = pd.merge(df_dist, df_subdist, on= ['Year','Month','addrcode'])
df_num.head()

   Year  Month addrcode  NumDist  NumSubdist
0  2014      1       10       49         111
1  2014      1       80       22          68
2  2014      1       81        7          16
3  2014      2       10       49         110
4  2014      2       80       20          52

### Result

In [10]:
df_province_case = pd.merge(df_num, df_numcase, on = ['Year','Month','addrcode'])
df_province_case.head()

   Year  Month addrcode  NumDist  NumSubdist  NumberCases
0  2014      1       10       49         111          405
1  2014      1       80       22          68          118
2  2014      1       81        7          16           31
3  2014      2       10       49         110          313
4  2014      2       80       20          52           74

In [11]:
#df_province_case.to_csv(os.path.join('data','Data Statistic','dengue_province_stat.csv'), encoding='utf-8')

## Weekly Temperature Data

### From Livestock Department

In [12]:
df_weather = pd.read_csv(os.path.join('data','Weather','Unused','weather_weekly_ID.csv'))
df_weather.columns = ['ID','TAM_NAME','Year','Week','Humidity','Rainfall','Temperature','Windspeed','addrcode']
df_weather = df_weather.dropna(how='any', axis=0)
df_weather['addrcode'] = df_weather['addrcode'].astype(int)
df_weather['addrcode'] = df_weather['addrcode'].astype(str)
df_weather.head()

,ID,TAM_NAME,Year,Week,Humidity,Rainfall,Temperature,Windspeed,addrcode
0,1,ท้องเนียน,2015,1,83.0,0.0,26.2,13.0,801503
1,2,ควนทอง,2015,1,83.0,0.0,26.2,13.0,801502
2,3,ขนอม,2015,1,83.0,0.0,26.2,13.0,801501
3,4,สิชล,2015,1,83.0,0.0,26.2,13.0,801401
4,5,สีขีด,2015,1,83.0,0.0,26.2,13.0,801406

In [13]:
df_weather_week = df_weather.groupby([df_weather['Year'],df_weather['Week'],df_weather['addrcode'].str[:2]]).size().reset_index(name = 'count')
df_weather_week.head()

   Year  Week addrcode  count
0  2015     1       80    161
1  2015     2       80    161
2  2015     3       80    161
3  2015     4       80    161
4  2015     5       80    161

In [14]:
df_weather = df_weather.dropna(how='any', axis=0)
df_weather.head()

,ID,TAM_NAME,Year,Week,Humidity,Rainfall,Temperature,Windspeed,addrcode
0,1,ท้องเนียน,2015,1,83.0,0.0,26.2,13.0,801503
1,2,ควนทอง,2015,1,83.0,0.0,26.2,13.0,801502
2,3,ขนอม,2015,1,83.0,0.0,26.2,13.0,801501
3,4,สิชล,2015,1,83.0,0.0,26.2,13.0,801401
4,5,สีขีด,2015,1,83.0,0.0,26.2,13.0,801406

In [15]:
df_week = df_weather.groupby([df_weather['Year'],df_weather['Week'],df_weather['addrcode'].str[:2]]).size().reset_index(name = 'count')
df_week.head()

   Year  Week addrcode  count
0  2015     1       80    161
1  2015     2       80    161
2  2015     3       80    161
3  2015     4       80    161
4  2015     5       80    161

In [16]:
df_week_count = df_week.groupby([df_week['Year']]).size().reset_index(name = 'week_count')
df_week_count.head()

   Year  week_count
0  2015          53
1  2016          53
2  2017          53
3  2018          20

## Monthly Rainfall Data 
### From Trop Med

In [17]:
df_rainfall = pd.read_csv(os.path.join('data','Weather','rainfall.csv'))
df_rainfall['addrcode'] = df_rainfall['addrcode'].astype(str)
df_rainfall.head()

  addrcode        date  rainfall_sum  rainfall_avg
0   100101  2014-03-01          7.23          7.23
1   100101  2014-04-01         47.91         47.91
2   100101  2014-05-01        142.65        142.65
3   100101  2014-06-01        123.27        123.27
4   100101  2014-07-01        109.71        109.71

In [18]:
df_rainfall['date'] = pd.to_datetime(df_rainfall['date'],format = '%Y-%m-%d')
df_rainfall['Year'] = df_rainfall['date'].dt.year
df_rainfall['Month'] = df_rainfall['date'].dt.month
df_rainfall = df_rainfall[['addrcode','date','Year','Month','rainfall_sum','rainfall_avg']]
df_rainfall.head()

  addrcode       date  Year  Month  rainfall_sum  rainfall_avg
0   100101 2014-03-01  2014      3          7.23          7.23
1   100101 2014-04-01  2014      4         47.91         47.91
2   100101 2014-05-01  2014      5        142.65        142.65
3   100101 2014-06-01  2014      6        123.27        123.27
4   100101 2014-07-01  2014      7        109.71        109.71

In [19]:
df_rainfallmonth = df_rainfall.groupby([df_rainfall['addrcode'].str[:2],df_rainfall['Year'],df_rainfall['Month']]).size().reset_index(name ='Count')
df_rainfallmonth.head()

  addrcode  Year  Month  Count
0       10  2014      3    154
1       10  2014      4    154
2       10  2014      5    154
3       10  2014      6    154
4       10  2014      7    154

In [20]:
df_rainfallyear = df_rainfallmonth.groupby([df_rainfallmonth['addrcode'].str[:2],df_rainfallmonth['Year']]).size().reset_index(name = 'NumMonth')
df_rainfallyear.head()

  addrcode  Year  NumMonth
0       10  2014        10
1       10  2015        12
2       10  2016        12
3       10  2017        12
4       10  2018         6

In [21]:
df_rainfall.loc[df_rainfall['addrcode'].str[:2] == '10'].head()

  addrcode       date  Year  Month  rainfall_sum  rainfall_avg
0   100101 2014-03-01  2014      3          7.23          7.23
1   100101 2014-04-01  2014      4         47.91         47.91
2   100101 2014-05-01  2014      5        142.65        142.65
3   100101 2014-06-01  2014      6        123.27        123.27
4   100101 2014-07-01  2014      7        109.71        109.71

In [22]:
df_rainfall_subdistlevel = df_rainfall.groupby(df_rainfall['addrcode']).size().reset_index(name = 'count')
df_rainfall_subdistlevel.head()

  addrcode  count
0   100101     52
1   100102     52
2   100103     52
3   100104     52
4   100105     52

In [23]:
df_rainfall_subdistlevel = df_rainfall_subdistlevel.loc[df_rainfall_subdistlevel['addrcode'].str.len() == 6]
df_rainfall_subdistlevel.head()

  addrcode  count
0   100101     52
1   100102     52
2   100103     52
3   100104     52
4   100105     52

In [24]:
df_rainfall_province = df_rainfall_subdistlevel.groupby(df_rainfall_subdistlevel['addrcode'].str[:2]).size().reset_index(name = 'count')
df_rainfall_province

  addrcode  count
0       10    154
1       80    168
2       81     59

In [25]:
df_rainfall_bangkok_subdist = df_rainfall_subdistlevel.loc[df_rainfall_subdistlevel['addrcode'].str[:2] == '10']
rainfall_bangkok_subdist = df_rainfall_bangkok_subdist['addrcode'].values
len(df_rainfall_bangkok_subdist)

154

In [26]:
df_rainfall_nakhon_subdist = df_rainfall_subdistlevel.loc[df_rainfall_subdistlevel['addrcode'].str[:2] == '80']
rainfall_nakhon_subdist = df_rainfall_nakhon_subdist['addrcode'].values
len(df_rainfall_nakhon_subdist)

168

In [27]:
df_rainfall_krabi_subdist = df_rainfall_subdistlevel.loc[df_rainfall_subdistlevel['addrcode'].str[:2] == '81']
rainfall_krabi_subdist = df_rainfall_krabi_subdist['addrcode'].values
len(df_rainfall_krabi_subdist)

59

## Number of missing sub-district

### Bangkok

In [162]:
missing_bangkok = set(bangkok_subdist) - set(rainfall_bangkok_subdist)
len(missing_bangkok)

53

In [163]:
missing_dist_bangkok = []
for i in range(len(missing_bangkok)):
    missing_dist_bangkok.append(missing_bangkok.pop())
missing_dist_bangkok = np.array(missing_dist_bangkok)
df_missing_dist_bangkok = pd.DataFrame(missing_dist_bangkok, columns = ['TA_ID'])
df_missing_dist_bangkok.head()

    TA_ID
0  102402
1  104502
2  101803
3  100804
4  101102

In [161]:
missing_sub_bangkok = pd.merge(df_dic,df_missing_dist_bangkok, how = 'inner')
missing_sub_bangkok.iloc[:,[0,1]].head()

    TA_ID      TAMBON_T
0  100206  ถนนนครไชยศรี
1  100304    คลองสิบสอง
2  100305        โคกแฝด
3  100306  คู้ฝั่งเหนือ
4  100307       ลำผักชี

In [169]:
invalid_bangkok = set(rainfall_bangkok_subdist) - set(bangkok_subdist)
len(invalid_bangkok)

38

### Nakhon-Si-Thammarat

In [30]:
missing_nakhon = set(nakhon_subdist) - set(rainfall_nakhon_subdist)
len(missing_nakhon)

2

In [164]:
missing_dist_nakhon = []
for i in range(len(missing_nakhon)):
    missing_dist_nakhon.append(missing_nakhon.pop())
missing_dist_nakhon = np.array(missing_dist_nakhon)
df_missing_dist_nakhon = pd.DataFrame(missing_dist_nakhon, columns = ['TA_ID'])
df_missing_dist_nakhon.head()

    TA_ID
0  800108
1  801201

In [165]:
missing_sub_nakhon = pd.merge(df_dic,df_missing_dist_nakhon, how = 'inner')
missing_sub_nakhon.iloc[:,[0,1]].head()

    TA_ID TAMBON_T
0  800108   นาทราย
1  801201  ปากพนัง

In [31]:
invalid_nakhon = set(rainfall_nakhon_subdist) - set(nakhon_subdist)
len(invalid_nakhon)

0

### Krabi

In [32]:
missing_krabi = set(krabi_subdist) - set(rainfall_krabi_subdist)
len(missing_krabi)

1

In [166]:
missing_dist_krabi = []
for i in range(len(missing_krabi)):
    missing_dist_krabi.append(missing_krabi.pop())
missing_dist_krabi = np.array(missing_dist_krabi)
df_missing_dist_krabi = pd.DataFrame(missing_dist_krabi, columns = ['TA_ID'])
df_missing_dist_krabi.head()

    TA_ID
0  810102

In [167]:
missing_sub_krabi = pd.merge(df_dic,df_missing_dist_krabi, how = 'inner')
missing_sub_krabi.iloc[:,[0,1]].head()

    TA_ID    TAMBON_T
0  810102  กระบี่ใหญ่

In [170]:
invalid_krabi = set(rainfall_krabi_subdist) - set(krabi_subdist)
invalid_krabi

{'810510', '810511', '810512', '810513', '810516', '810517', '810818'}

## Monthly Landscape Temperature Data
### From Trop Med

In [172]:
df_temp = pd.read_csv(os.path.join('data','Weather','temperature.csv'))
df_temp['addrcode'] = df_temp['addrcode'].astype(str)
df_temp.head()

  addrcode        date  temperature
0   100101  2014-01-01        34.39
1   100101  2014-02-01        36.77
2   100101  2014-03-01        39.61
3   100101  2014-04-01        37.45
4   100101  2014-05-01        40.71

In [173]:
df_temp['date'] = pd.to_datetime(df_temp['date'],format = '%Y-%m-%d')
df_temp['Year'] = df_temp['date'].dt.year
df_temp['Month'] = df_temp['date'].dt.month
df_temp = df_temp[['addrcode','date','Year','Month','temperature']]
df_temp.head()

  addrcode       date  Year  Month  temperature
0   100101 2014-01-01  2014      1        34.39
1   100101 2014-02-01  2014      2        36.77
2   100101 2014-03-01  2014      3        39.61
3   100101 2014-04-01  2014      4        37.45
4   100101 2014-05-01  2014      5        40.71

In [174]:
df_tempmonth = df_temp.groupby([df_temp['addrcode'].str[:2],df_temp['Year'],df_temp['Month']]).size().reset_index(name ='Count')
df_tempmonth.head()

  addrcode  Year  Month  Count
0       10  2014      1    154
1       10  2014      2    154
2       10  2014      3    154
3       10  2014      4    154
4       10  2014      5    154

In [175]:
df_tempyear = df_tempmonth.groupby([df_tempmonth['addrcode'].str[:2],df_tempmonth['Year']]).size().reset_index(name = 'NumMonth')
df_tempyear.head()

  addrcode  Year  NumMonth
0       10  2014        12
1       10  2015        12
2       10  2016        12
3       10  2017        12
4       10  2018         5

In [176]:
df_temp_subdistlevel = df_temp.groupby(df_temp['addrcode']).size().reset_index(name = 'count')
df_temp_subdistlevel.head()

  addrcode  count
0   100101     53
1   100102     53
2   100103     53
3   100104     53
4   100105     53

In [177]:
df_temp_province = df_temp_subdistlevel.groupby(df_temp_subdistlevel['addrcode'].str[:2]).size().reset_index(name = 'count')
df_temp_province

  addrcode  count
0       10    154
1       80    168
2       81     62

In [178]:
df_temp_bangkok_subdist = df_temp_subdistlevel.loc[df_temp_subdistlevel['addrcode'].str[:2] == '10']
temp_bangkok_subdist = df_temp_bangkok_subdist['addrcode'].values
len(df_temp_bangkok_subdist)

154

In [179]:
df_temp_nakhon_subdist = df_temp_subdistlevel.loc[df_temp_subdistlevel['addrcode'].str[:2] == '80']
temp_nakhon_subdist = df_temp_nakhon_subdist['addrcode'].values
len(df_temp_nakhon_subdist)

168

In [186]:
df_temp_krabi_subdist = df_temp_subdistlevel.loc[df_temp_subdistlevel['addrcode'].str[:2] == '81']
temp_krabi_subdist = df_temp_krabi_subdist['addrcode'].values
len(df_temp_krabi_subdist)

62

## Number of missing sub-district

### Bangkok

In [180]:
missing_temp_bangkok = set(bangkok_subdist) - set(temp_bangkok_subdist)
len(missing_temp_bangkok)

53

In [181]:
invalid_temp_bangkok = set(temp_bangkok_subdist) - set(bangkok_subdist) 
len(invalid_temp_bangkok)

38

### Nakhon-Si-Thammarat

In [182]:
missing_temp_nakhon = set(nakhon_subdist) - set(temp_nakhon_subdist)
len(missing_temp_nakhon)

2

In [183]:
invalid_temp_nakhon = set(temp_nakhon_subdist) - set(nakhon_subdist) 
len(invalid_temp_nakhon)

0

### Krabi

In [187]:
missing_temp_krabi = set(krabi_subdist) - set(temp_krabi_subdist)
len(missing_temp_krabi)

1

In [188]:
invalid_temp_krabi = set(temp_krabi_subdist) - set(krabi_subdist) 
invalid_temp_krabi

{'8101',
 '8103',
 '810510',
 '810511',
 '810512',
 '810513',
 '810516',
 '810517',
 '8108',
 '810818'}

## Monthly Breeding Site Detection Data

In [36]:
df_detection = pd.read_csv(os.path.join('Data','Breeding-sites','csv','addrcode-index','detection.csv'))
df_detection.head()

,date,addrcode,bin,bowl,bucket,cup,jar,pottedplant,tire,vase,total
0,2012-02-01,100508,838,44,2069,47,125,3744,447,15,7329
1,2012-02-01,104605,82,6,314,4,43,301,63,0,813
2,2012-02-01,104604,44,7,235,2,6,267,51,0,612
3,2017-06-01,103704,63,25,189,19,6,347,80,4,733
4,2017-05-01,100108,3,3,18,8,1,47,0,0,80

In [37]:
df_detection['date'] = pd.to_datetime(df_detection['date'],format = '%Y-%m-%d')
df_detection['Year'] = df_detection['date'].dt.year
df_detection['Month'] = df_detection['date'].dt.month
df_detection['addrcode'] = df_detection['addrcode'].astype(str)
df_detection['Year'] = df_detection['Year'].astype(str)
df_detection['Month'] = df_detection['Month'].astype(str)
df_detection = df_detection[['date','Year','Month','addrcode','bin','bowl','bucket','cup','jar','pottedplant','tire','vase','total']]
df_detection.head()

,date,Year,Month,addrcode,bin,bowl,bucket,cup,jar,pottedplant,tire,vase,total
0,2012-02-01,2012,2,100508,838,44,2069,47,125,3744,447,15,7329
1,2012-02-01,2012,2,104605,82,6,314,4,43,301,63,0,813
2,2012-02-01,2012,2,104604,44,7,235,2,6,267,51,0,612
3,2017-06-01,2017,6,103704,63,25,189,19,6,347,80,4,733
4,2017-05-01,2017,5,100108,3,3,18,8,1,47,0,0,80

In [38]:
df_detectionmonth = df_detection.groupby([df_detection['addrcode'].str[:2],df_detection['Year'],df_detection['Month']]).size().reset_index(name ='Count')
df_detectionmonth.head()

  addrcode  Year Month  Count
0       10  2011    12      9
1       10  2012     1     21
2       10  2012     2     21
3       10  2016    11      3
4       10  2016     7      1

In [39]:
df_detectionyear = df_detectionmonth.groupby([df_detectionmonth['addrcode'].str[:2],df_detectionmonth['Year']]).size().reset_index(name = 'NumMonth')
df_detectionyear

  addrcode  Year  NumMonth
0       10  2011         1
1       10  2012         2
2       10  2016         2
3       10  2017         5
4       80  2016         6
5       81  2016         3